app/controllers/businesses_controller.rb

SELECT * FROM `businesses`
---
  def index
    @businesses = Business.all

SELECT * FROM `members` WHERE (`members`.`id` IS NULL) LIMIT 1
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 2)
---
  def show
    @member = Member.find_by_id(session[:member_id])
    @title = "Business Details"
    @business = Business.find(params[:id])

SELECT * FROM `members` WHERE (`members`.`id` IS NULL) LIMIT 1
---
  def new
    @title = "Add Business"
    @member = Member.find_by_id(session[:member_id])

SELECT * FROM `members` WHERE (`members`.`id` = '2') LIMIT 1
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 8)
---
  def edit
    @member = Member.find_by_id(session[:member_id])
    @business = Business.find(params[:id])

SELECT * FROM `members` WHERE (`members`.`id` = '2') LIMIT 1
INSERT INTO `businesses` (`name`, `city`, `status`, `category`, `updated_at`, `owner`, `location`, `created_at`) VALUES('Google Drug Store', 'Delhi', 'unverified', 'Chemist', '2010-06-08 11:01:42', 'Jigar Patel', 'Rajiv_Chowk', '2010-06-08 11:01:42')
INSERT INTO `business_relations` (`status`, `updated_at`, `member_id`, `business_id`, `created_at`) VALUES(NULL, '2010-06-08 07:38:53', 2, 16, '2010-06-08 07:38:53')
---
  def create
    @member = Member.find_by_id(session[:member_id])
    @business = Business.new(params[:business])
    @business.owner = @member.first_name + " " + @member.last_name
    if @business.save
        @business_relation = BusinessRelation.new
        @business_relation.member_id = session[:member_id]
        @business_relation.business_id = @business.id
        @business_relation.status = 1
        if @business_relation.save

SELECT * FROM `members` WHERE (`members`.`id` = '2') LIMIT 1
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 6)
UPDATE `businesses` SET `location` = 'Patel_Nagar', `updated_at` = '2010-06-07 13:08:41', `name` = 'Hello 123' WHERE `id` = 7
---
  def update
    if request.put?
      @member = Member.find_by_id(session[:member_id])
      @business = Business.find(params[:id])
      if is_owner(@business)
        if @business.update_attributes(params[:business])

SELECT * FROM `businesses` WHERE (`businesses`.`id` = 6)
DELETE FROM `businesses` WHERE `id` = 6
---
  def destroy
    @business = Business.find(params[:id])
    if is_owner(@business)
      @business.destroy

SELECT * FROM `businesses` WHERE (`businesses`.`id` = '25') LIMIT 1
INSERT INTO `business_relations` (`status`, `updated_at`, `member_id`, `business_id`, `created_at`) VALUES(0, '2010-06-08 11:18:16', 2, 25, '2010-06-08 11:18:16')
---
  def add_favorite
    @business = Business.find_by_id(params[:id])
    @business_relation = BusinessRelation.new
    @business_relation.member_id = session[:member_id]
    @business_relation.business_id = @business.id
    @business_relation.status = 0
    if @business_relation.save