app/controllers/members_controller.rb

  def index
    if session[:logged_in] == true
      @member = Member.find_by_id(session[:member_id])
---
SELECT * FROM `members` WHERE (`members`.`id` IS NULL) LIMIT 1

  def show
    @member = Member.find_by_id(session[:member_id])
    @owned_businesses = @member.owned_businesses
    @favorite_businesses = @member.favorite_businesses
    @title = @member.first_name + " " + @member.last_name
---
SELECT * FROM `members` WHERE (`members`.`id` IS NULL) LIMIT 1
SELECT * FROM `businesses` WHERE (`businesses`.member_id = 2)

  def edit
    @member = Member.find_by_id(session[:member_id])
---
SELECT * FROM `members` WHERE (`members`.`id` = 2) LIMIT 1

  def create
    @member = Member.new(params[:member])
    if @member.save
---
INSERT INTO `members` (`salt`, `updated_at`, `hashed_password`, `phone_number`, `first_name`, `last_name`, `address`, `email`, `created_at`) VALUES('3b5WYkZFHARs1li', '2010-06-04 12:07:06', '833c9802879f623e302ea870229357e6365486da', '9898989898', 'Jigar ', 'Patel', 'E-306, Narwana Apartment\r\nDelhi-110092', 'jagira@gmail.com', '2010-06-04 12:07:06')

  def update
    @member = Member.find_by_id(session[:member_id])
    if @member.update_attributes(params[:member])
---
SELECT * FROM `members` WHERE (`members`.`id` = 2) LIMIT 1
UPDATE `members` SET `address` = 'E-306, Narwana Apt., I P Extension, Delhi -110092', `updated_at` = '2010-06-09 04:49:33' WHERE `id` = 2

  def destroy
    Member.find(session[:member_id]).destroy
---
DELETE FROM `members` WHERE `id` = 2
SELECT * FROM `members` WHERE (`members`.`id` = 2) LIMIT 1

  def change_password
    if request.get?
      @member = Member.find_by_id(session[:member_id])
      @title = "Change Password"
    elsif request.post?
      @member = Member.find_by_id(session[:member_id])
      @member.password_change = true
      if @member.update_attributes(params[:member])
---
SELECT * FROM `members` WHERE (`members`.`id` = 2) LIMIT 1
UPDATE `members` SET `hashed_password` = '73a407d65200982770a50c6fd786349d10d47492', `salt` = 'RWUKS8QDRbv8ZOT', `updated_at` = '2010-06-07 05:51:18' WHERE `id` = 2

  def forgot_password
    @title = "Forgot Password"
    if request.post?
      if params[:member][:email]
        member = Member.find_by_email(params[:member][:email])
---
SELECT `members`.id FROM `members` WHERE (`members`.`email` = BINARY 'jagira@gmail.com' AND `members`.id <> 2) LIMIT 1